tap "nikitabobko/tap"

# CLI tools
brew "git"
brew "asmvik/formulae/skhd"
brew "starship"
brew "zsh-autosuggestions"
brew "tmux"
brew "bat"
brew "tree-sitter"
brew "neovim"
brew "ripgrep"
brew "cloc"
brew "node"
brew "watchman"
brew "openjdk@21"
brew "pyenv"
brew "pipx"
brew "cmake"
brew "maven"
brew "cocoapods"

brew "cmatrix"
brew "cowsay"
brew "fastfetch"


# GUI apps
cask "nikitabobko/tap/aerospace"
cask "basictex"
cask "claude-code"
cask "font-0xproto-nerd-font"
cask "ghostty"
cask "scroll-reverser"
